import Foundation

extension RelativePeriodRule {
  static var russian: [Self] {
    [
      .words(
        .russian,
        "(?:(?<previous>прошл(?:ая|ый|ое|ые|ую|ой|ого)|последн(?:ие|яя|ий|ее|юю|ей|его))|"
          + "(?<next>следующ(?:ая|ий|ее|ие|ую|ей|его))|(?<current>эт(?:а|от|о|и|у|ой|ого)))\\s+"
          + "(?<amount>\(RU_INTEGER_WORDS_PATTERN)|[0-9]+|пол)?\\s*"
          + "(?<unit>секунд(?:а|ы|у)?|минут(?:а|ы|у)?|час(?:а|ов)?|день|дня|дней|недел(?:я|и|ю|ь)|месяц(?:а|ев)?|год(?:а|ов)?|лет)"
      )
    ]
  }
}
